The ramp's base (base level + base offset) must be below its top (top level + top offset).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RampStartHigherThanEnd { get; }
  Visual Basic
Public Shared ReadOnly Property RampStartHigherThanEnd As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RampStartHigherThanEnd {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace